Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E16A.tmx
Source language: en_us
Languages: zh_cn

source: Sausage making for beginners
zh_cn: 初学者如何制作香肠

source: There are few foods that reward a bit of care and attention quite as well as the simple banger.
zh_cn: 像香肠这样制作简单，省心省事的食物可不多。

source: A poorly made supermarket sausage can be an awful thing; recycling the worst waste meats and packed with fillers, fluids and modifiers enough to choke a goat.
zh_cn: 超市那些粗制滥造的香肠真是糟透了；回收烂肉，揣满了各种填塞物，液体还有乱七八糟的东西，都足够把一只羊给弄窒息了。

source: Yet a properly made artisanal sausage from an honest butcher calls forth hymns of praise from the lucky consumer.
zh_cn: 从实诚的肉贩那买到好香肠的幸运儿们真要高唱赞歌了。

source: What too few of us seem to realise is how little effort it can take to go one better and actually make our own sausages, controlling quality and flavours and producing something immeasurably more transcendent than the dispiriting slurry-packed condom in the polystyrene tray on the chiller shelf.
zh_cn: 我们中很少有人意识到自己制作香肠其实很简单方便，掌控好质量和味道，就可做出无比美味的香肠，而不是在冷冻柜里一盘盘的令人作呕的像塞满混合物的“安全套”一样的香肠。

source: Many are put off by the simple process - laid out for your convenience here - by worries about materials or equipment but this needn't be a problem.
zh_cn: 很多人因为担心原料或者制作工具而望而却步，但是步骤其实很简单，保持耐心，这些都不是问题。

source: Sausages require no more than pork, seasonings, casings and a mincer.
zh_cn: 制作香肠需要的就是肉，调味品，肠衣和一个绞肉机。

source: Let's deal with the biggest of those first.
zh_cn: 让我们从最重头的开始。

source: It's possible to buy hand-operated mincers which not only chop the meat but also, with the blade removed pack it into the skin for you.
zh_cn: 如果买手动的绞肉机，绞肉的同时你的胳膊也仿佛被灌铅了。

source: These are reasonably successful but producing a single kilo of sausage will leave you with a hypertrophic forearm like a fiddler crab on steroids.
zh_cn: 肉当然能绞成功，但是制作一公斤的香肠将会让你前臂粗壮，就像服了类固醇的招潮蟹一样。

source: Far better to search the houses of friends and relatives and seek out the individual with the biggest kitchen mixer.
zh_cn: 最好去朋友或亲戚的家里看看，找到有最大的厨房搅拌机的那个。

source: The best can be fitted with a mincer so it's worth clubbing together with friends to buy the attachment for the rare occasions it will be used.
zh_cn: 组装成一个绞肉机，正好朋友们也聚在一起，而不是花钱去买平常几乎用不到的这些附属品。

source: I borrowed a new Kenwood Chef for the demo and watched it cheerfully shift to low gear and satisfyingly reduce a small pig to paste.
zh_cn: 我借了一台新的健伍厨师牌搅拌机，欢欣鼓舞地看着它被调到低位档，然后把一小块一小块的猪肉绞成了肉糊。

source: Sausages skins are called 'casings' and come in two types.
zh_cn: 香肠的表面称为“肠衣”，分为两种类型。

source: Collagen casings are made from reconstituted meat products and extruded into a long, regular tube.
zh_cn: 胶原质肠衣，由可再生的肉类产品造成并挤压成长的规则的管状。

source: They are great for things like Frankfurters but for a real sausage you need to go straight for the guts - traditional 'natural' casings are scrubbed, cleaned lengths of animal intestine.
zh_cn: 它们是制作法兰克福香肠的绝佳选择，但是对于普通的香肠我们还是直接选用肠类，把动物的肠取段清洗处理干净做成传统的天然肠衣。

source: I order mine from sausagemaking.org who send them by post.
zh_cn: 我的肠衣是在香肠制造网站订购的，邮寄到达。

source: Trust me, there are few more satisfying sounds to the epicure than that of 40 metres of pig gut landing on your doormat.
zh_cn: 相信我的忠告吧，那比你在家门口堆着40米长的猪肠子要好得多。

source: With mincer and casings procured, the rest, as you'll see from the pictures, is as simple as pumping pork into a pipe.
zh_cn: 准备好绞肉机和肠衣，剩下的，如你从图片里看到的，就是把肉装到肠衣里这么简单。

source: You can vary your sausages with all manner of flavourings: add a little white wine, diced bacon, garlic, rosemary and thyme for a Toulouse; garlic, crushed fennel seed and a shot of red wine for authentic tasting Italian salsicci; add smoked paprika for a reasonable facsimile of chorizo or even swap pork for lamb, add a hefty dollop of harissa and create your own merguez.
zh_cn: 你可以通过各种调味料来变换香肠的口味：加点白葡萄酒，咸肉粒，大蒜，迷迭香和土鲁斯的百里香；大蒜，碾碎的茴香和一点红酒就会调和出意大利salsicci香肠的地道风味来；加入烟熏辣椒粉就会有纯正的西班牙香肠的味道或者干脆把猪肉换成羊肉，加入一大勺突尼斯辣酱就可以自己做出美味的梅尔盖兹香肠。

source: The world, to coin a phrase, is your sausage.
zh_cn: 夸张点说，这就是你的香肠世界。

source: One last thought.
zh_cn: 最后的思考。

source: Once you've invested time, effort and, let's face it, a few smutty giggles, into making your own sausages, it's worth going to the effort of cooking them properly.
zh_cn: 既然你已经付出时间，精力（也许还有别人的嗤笑）来制作香肠了，那么在烹饪香肠上也不能应付了事。

source: Don't, whatever you do, chuck them in a hot pan and prick them with a fork - the sausage skin does an admirable job of keeping all the lovely juices in and the nasty frying fat out so just trust that the insides are going to braise in their own loveliness.
zh_cn: 请一定不要就把香肠扔到热锅里用叉子戳来戳去的。香肠的肠衣把内在的汁液精华完美地包裹住，把令人厌恶的油炸产生的脂肪排斥在外，所以请静静地等待香肠内部美味的升华。

source: If you're worried about the fat content go suck a carrot.
zh_cn: 如果担心脂肪含量的话，那你还是去啃胡萝卜吧。

source: The truly ideal way to cook a sausage is to poach it slowly sunk to its hips in a bath of olive oil but, failing that, massage each individually with oil first then slide them into an oiled pan and keep them rolling, on a low heat, for as long and as continuously as possible.
zh_cn: 真正理想的香肠烹饪方法是在橄榄油油槽里，让油浸过香肠，慢慢地煨。如果不这样做的话，先把每个香肠在油里均匀沾一下，然后把它们下到热油锅里，尽可能连续不停地翻动，炉子温度要低。

source: Trust me, even 25 minutes of gently rolling them back and forth, jostling their plumply greased little bodies against each other is not too long.
zh_cn: 相信我，把涂满油的香肠在锅里来回翻动25分钟不算长。

source: As the skins change to a light tan, then begin to caramelise as the Maillard reaction takes place, you'll find yourself shifting into the perfect meditative state to honour your sausage.
zh_cn: 当表面变为亮棕色，然后开始焦糖化----就像发生了美拉德反应，你会发现自己深深地沉浸在制作和烹饪香肠的自豪和享受状态中。

source: How to make pork sausages
zh_cn: 怎么制作香肠？

source: Similar quantities of back and shoulder pork.
zh_cn: 1.差不多重量的猪脊背和前腿肉。

source: I've used a kilo of each.
zh_cn: 我用的是各一公斤。

source: It's worth getting the good stuff so this is Tamworth
zh_cn: 选取好的原材料是必须的，这里用的是塔姆沃思猪肉。

source: Soak hog casings to remove salt
zh_cn: 2.把肠衣浸泡来去除多余的盐分。

source: Select your spicing mix.
zh_cn: 3.挑选好各种调味品。

source: For a traditional English breakfast style sausage I've gone for savory, sage, allspice and white pepper.
zh_cn: 作为传统的英式早餐香肠，我选的是香薄荷，鼠尾草，多香果和白胡椒。

source: You'll also need plenty of salt.
zh_cn: 还需要准备大量的盐。

source: Grind the spice mix in a pestle and mortar but keep the salt to one side
zh_cn: 用杵和臼把混合的调味品捣碎，但是食盐单独放在一边。

source: Remove any skin or bones from the pork and slice into cubes small enough to fit into the throat of your grinder.
zh_cn: 4.去除肉皮和骨头，把肉切成能够装入绞肉机口的小块。

source: Salt generously then put it into a freezer for half an hour or so.
zh_cn: 用盐均匀地腌渍，然后放到冰箱里半小时左右。

source: This stiffens the meat and makes mincing easier
zh_cn: 这样使肉变硬，更易于绞碎。

source: Pass the meat through the mincer once.
zh_cn: 5.肉只过一遍绞肉机。

source: I prefer a coarse plate for a chunkier sausage but use a fine one or pass the meat twice through if you want something more smooth and shop-bought
zh_cn: 我比较喜欢一个朴素的盘子装着粗壮的香肠。但如果你喜欢口感细腻，看上去精美的香肠的话就用好一点的盘子，让肉过两遍绞肉机。

source: Add breadcrumbs (10% by weight) and half of your spice mix and mix thoroughly through the meat with your hands.
zh_cn: 6.用手把一部分的调味料、肉和面包屑（总量的10%）均匀和开。

source: Fry a teaspoonful in a hot pan to check the seasoning and adjust accordingly
zh_cn: 取一茶匙的量在热锅里煎炸，来尝尝调味料是否够味，然后作相应的调整。

source: Slip the wet casing over the funnel attachment of your grinder
zh_cn: 7.把湿的肠衣用绞肉机的漏斗给撑开。

source: Remove the blades from the grinder, mount the stuffing funnel and set the machine going on its slowest setting.
zh_cn: 8.把绞肉机的刀刃取下，装上撑肠衣的漏斗，把机器调到最小的档位。

source: Keep your fingers around the rolled casing, paying it out as required.
zh_cn: 把手指圈在肠衣的外围，小心操作。

source: Leave a good length of casing empty before starting to fill
zh_cn: 在装肉糊前留一截空的肠衣。

source: Don't allow the meat to pack too tight but try to avoid allowing air in either.
zh_cn: 9.不要让肉压得过于紧实，但也要多余的空隙。

source: Beginners should fill about a metre of casing at a time then cut it off leaving plenty of spare casing at either end
zh_cn: 初学者应该一次就灌一米的香肠，然后剪开，再留一段空肠衣再灌。

source: Tie off one end of each length of casing then gently squeeze enough space to twist the sausage a few times between each link
zh_cn: 10.把每一段香肠的末端系紧，挤出足够的空间让香肠可以扭成一段一段的。
